openxc/vi-firmware/cantranslator/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_can.c
	//clear ALUT RAM
	for (i = 0; i < 512; i++)
	{
		LPC_CANAF_RAM->mask[i] = 0x00;
	}

	LPC_CANAF->SFF_sa = 0x00;
	LPC_CANAF->SFF_GRP_sa = 0x00;
	LPC_CANAF->EFF_sa = 0x00;
	LPC_CANAF->EFF_GRP_sa = 0x00;
	LPC_CANAF->ENDofTable = 0x00;

	LPC_CANAF->AFMR = 0x00;

	/* Set baudrate */
	can_SetBaudrate (pCan, baudrate);
}

/********************************************************************//**
 * @brief		CAN deInit
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @return 		None
 *********************************************************************/
void CAN_DeInit(uint8_t canId)
{
	if(canId == CAN_ID_1)
	{
		/* Turn on power and clock for CAN1 */
		CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCAN1, DISABLE);
	}
	else if(canId == CAN_ID_2)
	{
		/* Turn on power and clock for CAN1 */
		CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCAN2, DISABLE);
	}

	return;
}

/********************************************************************//**
 * @brief		Setup Acceptance Filter Look-Up Table
 * @param[in]	CANAFx	pointer to LPC_CANAF_TypeDef
 * 				Should be: LPC_CANAF
 * @param[in]	AFSection	the pointer to AF_SectionDef structure
 * 				It contain information about 5 sections will be install in AFLUT
 * @return 		CAN Error	could be:
 * 				- CAN_OBJECTS_FULL_ERROR: No more rx or tx objects available
 * 				- CAN_AF_ENTRY_ERROR: table error-violation of ascending numerical order
 * 				- CAN_OK: ID is added into table successfully
 *********************************************************************/
CAN_ERROR CAN_SetupAFLUT(AF_SectionDef* AFSection)
{
	uint8_t ctrl1,ctrl2;
	uint8_t dis1, dis2;
	uint16_t SID, ID_temp,i, count = 0;
	uint32_t EID, entry, buf;
	uint16_t lowerSID, upperSID;
	uint32_t lowerEID, upperEID;

	LPC_CANAF->AFMR = 0x01;

	/***** setup FullCAN Table *****/
	if(AFSection->FullCAN_Sec == NULL)
	{
		FULLCAN_ENABLE = DISABLE;
	}
	else
	{
		FULLCAN_ENABLE = ENABLE;

		for(i = 0; i < (AFSection->FC_NumEntry); i++)
		{
			if(count + 1 > 64)
			{
				return CAN_OBJECTS_FULL_ERROR;
			}

			ctrl1 = AFSection->FullCAN_Sec->controller;

			SID = AFSection->FullCAN_Sec->id_11;

			dis1 = AFSection->FullCAN_Sec->disable;

			entry = 0x00; //reset entry value

			if((CANAF_FullCAN_cnt & 0x00000001)==0)
			{
				if(count != 0x00)
				{
					buf = LPC_CANAF_RAM->mask[count-1];
					ID_temp = (buf & 0xE7FF); //mask controller & identifier bits
					if(ID_temp > ((ctrl1<<13)|SID))
					{
						return CAN_AF_ENTRY_ERROR;
					}
				}

				entry = (ctrl1<<29)|(dis1<<28)|(SID<<16)|(1<<27);

				LPC_CANAF_RAM->mask[count] &= 0x0000FFFF;

				LPC_CANAF_RAM->mask[count] |= entry;

				CANAF_FullCAN_cnt++;
				if(CANAF_FullCAN_cnt == AFSection->FC_NumEntry) //this is the lastest FullCAN entry
					count++;
			}
			else
			{
				buf = LPC_CANAF_RAM->mask[count];
				ID_temp = (buf >>16) & 0xE7FF;
				if(ID_temp > ((ctrl1<<13)|SID))
				{
					return CAN_AF_ENTRY_ERROR;
				}

				entry = (ctrl1 << 13) | (dis1 << 12) | (SID << 0) | (1 << 11);

				LPC_CANAF_RAM->mask[count] &= 0xFFFF0000;

				LPC_CANAF_RAM->mask[count]|= entry;

				count++;

				CANAF_FullCAN_cnt++;
			}

			AFSection->FullCAN_Sec = (FullCAN_Entry *)((uint32_t)(AFSection->FullCAN_Sec)+ sizeof(FullCAN_Entry));
		}
	}

	/***** Setup Explicit Standard Frame Format Section *****/
	if(AFSection->SFF_Sec != NULL)
	{
		for(i=0;i<(AFSection->SFF_NumEntry);i++)
		{
			if(count + 1 > 512)
			{
				return CAN_OBJECTS_FULL_ERROR;
			}

			ctrl1 = AFSection->SFF_Sec->controller;

			SID = AFSection->SFF_Sec->id_11;

			dis1 = AFSection->SFF_Sec->disable;

			entry = 0x00; //reset entry value

			if((CANAF_std_cnt & 0x00000001)==0)
			{
				if(CANAF_std_cnt !=0 )
				{
					buf = LPC_CANAF_RAM->mask[count-1];
					ID_temp = (buf & 0xE7FF); //mask controller & identifier bits
					if(ID_temp > ((ctrl1<<13)|SID))
					{
						return CAN_AF_ENTRY_ERROR;
					}
				}

				entry = (ctrl1<<29)|(dis1<<28)|(SID<<16);

				LPC_CANAF_RAM->mask[count] &= 0x0000FFFF;

				LPC_CANAF_RAM->mask[count] |= entry;

				CANAF_std_cnt++;
				if(CANAF_std_cnt == AFSection->SFF_NumEntry)//if this is the last SFF entry
					count++;
			}
			else
			{
				buf = LPC_CANAF_RAM->mask[count];
				ID_temp = (buf >>16) & 0xE7FF;
				if(ID_temp > ((ctrl1<<13)|SID))
				{
					return CAN_AF_ENTRY_ERROR;
				}

				entry = (ctrl1 << 13) | (dis1 << 12) | (SID << 0);

				LPC_CANAF_RAM->mask[count] &= 0xFFFF0000;

				LPC_CANAF_RAM->mask[count] |= entry;

				count++;

				CANAF_std_cnt++;
			}

			AFSection->SFF_Sec = (SFF_Entry *)((uint32_t)(AFSection->SFF_Sec)+ sizeof(SFF_Entry));
		}
	}

	/***** Setup Group of Standard Frame Format Identifier Section *****/
	if(AFSection->SFF_GPR_Sec != NULL)
	{
		for(i=0;i<(AFSection->SFF_GPR_NumEntry);i++)
		{
			if(count + 1 > 512)
			{
				return CAN_OBJECTS_FULL_ERROR;
			}

			ctrl1 = AFSection->SFF_GPR_Sec->controller1;

			ctrl2 = AFSection->SFF_GPR_Sec->controller2;

			dis1 = AFSection->SFF_GPR_Sec->disable1;

			dis2 = AFSection->SFF_GPR_Sec->disable2;

			lowerSID = AFSection->SFF_GPR_Sec->lowerID;

			upperSID = AFSection->SFF_GPR_Sec->upperID;

			entry = 0x00;

			if(CANAF_gstd_cnt!=0)
			{
				buf = LPC_CANAF_RAM->mask[count-1];
				ID_temp = buf & 0xE7FF;
				if((ctrl1 != ctrl2)||(lowerSID > upperSID)||(ID_temp > ((ctrl1<<13)|lowerSID)))
				{
					return CAN_AF_ENTRY_ERROR;
				}
			}
			entry = (ctrl1 << 29)|(dis1 << 28)|(lowerSID << 16)|  \
					(ctrl2 << 13)|(dis2 << 12)|(upperSID << 0);
			LPC_CANAF_RAM->mask[count] = entry;

			CANAF_gstd_cnt++;

			count++;

			AFSection->SFF_GPR_Sec = (SFF_GPR_Entry *)((uint32_t)(AFSection->SFF_GPR_Sec)+ sizeof(SFF_GPR_Entry));
		}
	}

	/***** Setup Explicit Extend Frame Format Identifier Section *****/
	if(AFSection->EFF_Sec != NULL)
	{
		for(i=0;i<(AFSection->EFF_NumEntry);i++)
		{
			if(count + 1 > 512)
			{
				return CAN_OBJECTS_FULL_ERROR;
			}

