openxc/vi-firmware/cantranslator/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_can.c
		buf0 = tmp0;

		buf1 = tmp1;

		buf2 = tmp2;

		cnt1+=3;
	}

	CANAF_FullCAN_cnt++;

	//update address values
	LPC_CANAF->SFF_sa 	  += 0x04;

	LPC_CANAF->SFF_GRP_sa += 0x04 ;

	LPC_CANAF->EFF_sa     += 0x04 ;

	LPC_CANAF->EFF_GRP_sa += 0x04;

	LPC_CANAF->ENDofTable += 0x04;

	LPC_CANAF->AFMR = 0x04;

 	return CAN_OK;
}

/********************************************************************//**
 * @brief		Load Group entry into AFLUT
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	lowerID, upperID: lower and upper identifier of entry
 * @param[in]	format: type of ID format, should be:
 * 				- STD_ID_FORMAT: Standard ID format (11-bit value)
 * 				- EXT_ID_FORMAT: Extended ID format (29-bit value)
 * @return 		CAN_ERROR, could be:
 * 				- CAN_OK: loading is successful
 * 				- CAN_CONFLICT_ID_ERROR: Conflict ID occurs
 * 				- CAN_OBJECTS_FULL_ERROR: no more space available
 *********************************************************************/
CAN_ERROR CAN_LoadGroupEntry(uint8_t canId, uint32_t lowerID,
										uint32_t upperID, CAN_ID_FORMAT_Type format)
{
	uint32_t buf0, buf1, entry1, entry2, LID,UID;
	int16_t cnt1, bound1, total;

	if(lowerID > upperID)
		return CAN_CONFLICT_ID_ERROR;

	total =((CANAF_FullCAN_cnt+1) >> 1)+ CANAF_FullCAN_cnt*3 +((CANAF_std_cnt + 1) >> 1)  \
				+ CANAF_gstd_cnt + CANAF_ext_cnt + (CANAF_gext_cnt<<1);

	/* Setup Acceptance Filter Configuration
	Acceptance Filter Mode Register = Off */
	LPC_CANAF->AFMR = 0x00000001;

	/*********Add Group of Standard Identifier Frame Format************/
	if(format == STD_ID_FORMAT)
	{
		if ((total >= 512))
		{
			//don't have enough space
			return CAN_OBJECTS_FULL_ERROR;
		}

		lowerID &=0x7FF; //mask ID

		upperID &=0x7FF;

		entry1  = (canId << 29) | (lowerID << 16) | (canId << 13)|(upperID << 0);

		cnt1 = ((CANAF_FullCAN_cnt+1)>>1) + ((CANAF_std_cnt + 1) >> 1);

		//if this is the first Group standard ID entry
		if(CANAF_gstd_cnt == 0)
		{
			LPC_CANAF_RAM->mask[cnt1] = entry1;
		}
		else
		{
			//find the position to add new Group entry
			bound1 = ((CANAF_FullCAN_cnt+1)>>1) + ((CANAF_std_cnt + 1) >> 1) + CANAF_gstd_cnt;

			while(cnt1 < bound1)
			{
				//compare controller first
				while((LPC_CANAF_RAM->mask[cnt1] >> 29)< (entry1 >> 29))//increase until meet greater or equal controller
					cnt1++;
				buf0 = LPC_CANAF_RAM->mask[cnt1];
				if((LPC_CANAF_RAM->mask[cnt1] >> 29)> (entry1 >> 29)) //meet greater controller
				{
					//add at this position
					LPC_CANAF_RAM->mask[cnt1] = entry1;
					break;
				}
				else //meet equal controller
				{
					LID  = (buf0 >> 16)&0x7FF;
					UID  = buf0 & 0x7FF;
					if (upperID <= LID)
					{
						//add new entry before this entry
						LPC_CANAF_RAM->mask[cnt1] = entry1;
						break;
					}
					else if (lowerID >= UID)
					{
						//load next entry to compare
						cnt1 ++;
					}
					else
						return CAN_CONFLICT_ID_ERROR;
				}
			}
			if(cnt1 >= bound1)
			{
				//add new entry at the last position in this list
				buf0 = LPC_CANAF_RAM->mask[cnt1];

				LPC_CANAF_RAM->mask[cnt1] = entry1;
			}

			//remove all remaining entry of this section one place up
			bound1 = total - cnt1;

			while(bound1--)
			{
				cnt1++;

				buf1 = LPC_CANAF_RAM->mask[cnt1];

				LPC_CANAF_RAM->mask[cnt1] = buf0;

				buf0 = buf1;
			}
		}

		CANAF_gstd_cnt++;

		//update address values
		LPC_CANAF->EFF_sa     +=0x04 ;

		LPC_CANAF->EFF_GRP_sa +=0x04;

		LPC_CANAF->ENDofTable +=0x04;
	}


	/*********Add Group of Extended Identifier Frame Format************/
	else
	{
		if ((total >= 511))
		{
			//don't have enough space
			return CAN_OBJECTS_FULL_ERROR;
		}

		lowerID  &= 0x1FFFFFFF; //mask ID

		upperID &= 0x1FFFFFFF;

		entry1   = (canId << 29)|(lowerID << 0);

		entry2   = (canId << 29)|(upperID << 0);

		cnt1 = ((CANAF_FullCAN_cnt+1)>>1) + ((CANAF_std_cnt + 1) >> 1) + CANAF_gstd_cnt + CANAF_ext_cnt;

		//if this is the first Group standard ID entry
		if(CANAF_gext_cnt == 0)
		{
			LPC_CANAF_RAM->mask[cnt1] = entry1;

			LPC_CANAF_RAM->mask[cnt1+1] = entry2;
		}
		else
		{
			//find the position to add new Group entry
			bound1 = ((CANAF_FullCAN_cnt+1)>>1) + ((CANAF_std_cnt + 1) >> 1) + CANAF_gstd_cnt \
						+ CANAF_ext_cnt + (CANAF_gext_cnt<<1);

			while(cnt1 < bound1)
			{
				while((LPC_CANAF_RAM->mask[cnt1] >>29)< canId) //increase until meet greater or equal controller
					cnt1++;
				buf0 = LPC_CANAF_RAM->mask[cnt1];

				buf1 = LPC_CANAF_RAM->mask[cnt1+1];
				if((LPC_CANAF_RAM->mask[cnt1] >> 29)> canId) //meet greater controller
				{
					//add at this position
					LPC_CANAF_RAM->mask[cnt1] = entry1;
					LPC_CANAF_RAM->mask[++cnt1] = entry2;
					break;
				}
				else //meet equal controller
				{
					LID  = buf0 & 0x1FFFFFFF; //mask ID
					UID  = buf1 & 0x1FFFFFFF;
					if (upperID <= LID)
					{
						//add new entry before this entry
						LPC_CANAF_RAM->mask[cnt1] = entry1;
						LPC_CANAF_RAM->mask[++cnt1] = entry2;
						break;
					}
					else if (lowerID >= UID)
					{
						//load next entry to compare
						cnt1 +=2;
					}
					else
						return CAN_CONFLICT_ID_ERROR;
				}
			}
			if(cnt1 >= bound1)
			{
				//add new entry at the last position in this list
				buf0 = LPC_CANAF_RAM->mask[cnt1];

				buf1 = LPC_CANAF_RAM->mask[cnt1+1];

				LPC_CANAF_RAM->mask[cnt1]   = entry1;

				LPC_CANAF_RAM->mask[++cnt1] = entry2;
			}

			//remove all remaining entry of this section two place up
			bound1 = total - cnt1 + 1;

			cnt1++;

			while(bound1>0)
			{
				entry1 = LPC_CANAF_RAM->mask[cnt1];

				entry2 = LPC_CANAF_RAM->mask[cnt1+1];

				LPC_CANAF_RAM->mask[cnt1]   = buf0;

				LPC_CANAF_RAM->mask[cnt1+1] = buf1;

				buf0 = entry1;

				buf1 = entry2;

				cnt1   +=2;

				bound1 -=2;
			}
		}

		CANAF_gext_cnt++;

		//update address values
		LPC_CANAF->ENDofTable +=0x08;
	}

	LPC_CANAF->AFMR = 0x04;

 	return CAN_OK;
}

