openxc/vi-firmware/cantranslator/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_can.c
			*((uint8_t *) &CAN_Msg->dataA[3])= (data & 0xFF000000) >> 24;

			/* Read second 4 data bytes */
			data = pCan->RDB;

			*((uint8_t *) &CAN_Msg->dataB[0])= data & 0x000000FF;

			*((uint8_t *) &CAN_Msg->dataB[1])= (data & 0x0000FF00) >> 8;

			*((uint8_t *) &CAN_Msg->dataB[2])= (data & 0x00FF0000) >> 16;

			*((uint8_t *) &CAN_Msg->dataB[3])= (data & 0xFF000000) >> 24;

			/*release receive buffer*/
			pCan->CMR = 0x04;
		}
		else
		{
			/* Received Frame is a Remote Frame, not have data, we just receive
			 * message information only */
			pCan->CMR = 0x04; /*release receive buffer*/

			return SUCCESS;
		}
	}
	else
	{
		// no receive message available
		return ERROR;
	}

	return SUCCESS;
}

/********************************************************************//**
 * @brief		Receive FullCAN Object
 * @param[in]	CANAFx: CAN Acceptance Filter register, should be: LPC_CANAF
 * @param[in]	CAN_Msg point to the CAN_MSG_Type Struct, it will contain received
 *  			message information such as: ID, DLC, RTR, ID Format
 * @return 		CAN_ERROR, could be:
 * 				- CAN_FULL_OBJ_NOT_RCV: FullCAN Object is not be received
 * 				- CAN_OK: Received FullCAN Object successful
 *
 *********************************************************************/
CAN_ERROR FCAN_ReadObj (CAN_MSG_Type *CAN_Msg)
{
	uint32_t *pSrc, data;
	uint32_t interrut_word, msg_idx, test_bit, head_idx, tail_idx;

	interrut_word = 0;

	if (LPC_CANAF->FCANIC0 != 0)
	{
		interrut_word = LPC_CANAF->FCANIC0;

		head_idx = 0;

		tail_idx = 31;
	}
	else if (LPC_CANAF->FCANIC1 != 0)
	{
		interrut_word = LPC_CANAF->FCANIC1;

		head_idx = 32;

		tail_idx = 63;
	}

	if (interrut_word != 0)
	{
		/* Detect for interrupt pending */
		msg_idx = 0;

		for (msg_idx = head_idx; msg_idx <= tail_idx; msg_idx++)
		{
			test_bit = interrut_word & 0x1;

			interrut_word = interrut_word >> 1;

			if (test_bit)
			{
				pSrc = (uint32_t *) (LPC_CANAF->ENDofTable + LPC_CANAF_RAM_BASE + msg_idx * 12);

				/* Has been finished updating the content */
				if ((*pSrc & 0x03000000L) == 0x03000000L)
				{
					/*clear semaphore*/
					*pSrc &= 0xFCFFFFFF;

					/*Set to DatA*/
					pSrc++;

					/* Copy to dest buf */
					data = *pSrc;

					*((uint8_t *) &CAN_Msg->dataA[0])= data & 0x000000FF;

					*((uint8_t *) &CAN_Msg->dataA[1])= (data & 0x0000FF00) >> 8;

					*((uint8_t *) &CAN_Msg->dataA[2])= (data & 0x00FF0000) >> 16;

					*((uint8_t *) &CAN_Msg->dataA[3])= (data & 0xFF000000) >> 24;

					/*Set to DatB*/
					pSrc++;

					/* Copy to dest buf */
					data = *pSrc;

					*((uint8_t *) &CAN_Msg->dataB[0])= data & 0x000000FF;

					*((uint8_t *) &CAN_Msg->dataB[1])= (data & 0x0000FF00) >> 8;

					*((uint8_t *) &CAN_Msg->dataB[2])= (data & 0x00FF0000) >> 16;

					*((uint8_t *) &CAN_Msg->dataB[3])= (data & 0xFF000000) >> 24;

					/*Back to Dat1*/
					pSrc -= 2;

					CAN_Msg->id = *pSrc & 0x7FF;

					CAN_Msg->len = (uint8_t) (*pSrc >> 16) & 0x0F;

					CAN_Msg->format = 0; //FullCAN Object ID always is 11-bit value

					CAN_Msg->type = (uint8_t)(*pSrc >> 30) &0x01;

					/*Re-read semaphore*/
					if ((*pSrc & 0x03000000L) == 0)
					{
						return CAN_OK;
					}
				}
			}
		}
	}

	return CAN_FULL_OBJ_NOT_RCV;
}

/********************************************************************//**
 * @brief		Get CAN Control Status
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	arg: type of CAN status to get from CAN status register
 * 				Should be:
 * 				- CANCTRL_GLOBAL_STS: CAN Global Status
 * 				- CANCTRL_INT_CAP: CAN Interrupt and Capture
 * 				- CANCTRL_ERR_WRN: CAN Error Warning Limit
 * 				- CANCTRL_STS: CAN Control Status
 * @return 		Current Control Status that you want to get value
 *********************************************************************/
uint32_t CAN_GetCTRLStatus (uint8_t canId, CAN_CTRL_STS_Type arg)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	switch (arg)
	{
		case CANCTRL_GLOBAL_STS:
			return pCan->GSR;

		case CANCTRL_INT_CAP:
			return pCan->ICR;

		case CANCTRL_ERR_WRN:
			return pCan->EWL;

		default: // CANCTRL_STS
			return pCan->SR;
	}
}
/********************************************************************//**
 * @brief		Get CAN Central Status
 * @param[in]	CANCRx point to LPC_CANCR_TypeDef, should be: LPC_CANCR
 * @param[in]	arg: type of CAN status to get from CAN Central status register
 * 				Should be:
 * 				- CANCR_TX_STS: Central CAN Tx Status
 * 				- CANCR_RX_STS: Central CAN Rx Status
 * 				- CANCR_MS: Central CAN Miscellaneous Status
 * @return 		Current Central Status that you want to get value
 *********************************************************************/
uint32_t CAN_GetCRStatus (CAN_CR_STS_Type arg)
{
	switch (arg)
	{
		case CANCR_TX_STS:
			return LPC_CANCR->TxSR;

		case CANCR_RX_STS:
			return LPC_CANCR->RxSR;

		default:	// CANCR_MS
			return LPC_CANCR->MSR;
	}
}
/********************************************************************//**
 * @brief		Enable/Disable CAN Interrupt
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	arg: type of CAN interrupt that you want to enable/disable
 * 				Should be:
 * 				- CANINT_RIE: CAN Receiver Interrupt Enable
 * 				- CANINT_TIE1: CAN Transmit Interrupt Enable
 * 				- CANINT_EIE: CAN Error Warning Interrupt Enable
 * 				- CANINT_DOIE: CAN Data Overrun Interrupt Enable
 * 				- CANINT_WUIE: CAN Wake-Up Interrupt Enable
 * 				- CANINT_EPIE: CAN Error Passive Interrupt Enable
 * 				- CANINT_ALIE: CAN Arbitration Lost Interrupt Enable
 * 				- CANINT_BEIE: CAN Bus Error Interrupt Enable
 * 				- CANINT_IDIE: CAN ID Ready Interrupt Enable
 * 				- CANINT_TIE2: CAN Transmit Interrupt Enable for Buffer2
 * 				- CANINT_TIE3: CAN Transmit Interrupt Enable for Buffer3
 * 				- CANINT_FCE: FullCAN Interrupt Enable
 * @param[in]	NewState: New state of this function, should be:
 * 				- ENABLE
 * 				- DISABLE
 * @return 		none
 *********************************************************************/
void CAN_IRQCmd (uint8_t canId, CAN_INT_EN_Type arg, FunctionalState NewState)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	if(NewState == ENABLE)
	{
		if(arg == CANINT_FCE)
		{
			LPC_CANAF->AFMR = 0x01;

			LPC_CANAF->FCANIE = 0x01;

			LPC_CANAF->AFMR = 0x04;
		}
		else
			pCan->IER |= (1 << arg);
	}
	else
	{
		if(arg == CANINT_FCE)
		{
			LPC_CANAF->AFMR = 0x01;

			LPC_CANAF->FCANIE = 0x01;

			LPC_CANAF->AFMR = 0x00;
		}
		else
			pCan->IER &= ~(1 << arg);
	}
}

