openxc/vi-firmware/cantranslator/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_can.c
/********************************************************************//**
 * @brief		Setting Acceptance Filter mode
 * @param[in]	CANAFx point to LPC_CANAF_TypeDef object, should be: LPC_CANAF
 * @param[in]	AFMode: type of AF mode that you want to set, should be:
 * 				- CAN_NORMAL: Normal mode
 * 				- CAN_ACC_OFF: Acceptance Filter Off Mode
 * 				- CAN_ACC_BP: Acceptance Fileter Bypass Mode
 * 				- CAN_EFCAN: FullCAN Mode Enhancement
 * @return 		none
 *********************************************************************/
void CAN_SetAFMode (CAN_AFMODE_Type AFMode)
{
	switch(AFMode)
	{
		case CAN_NORMAL:
			LPC_CANAF->AFMR = 0x00;
			break;

		case CAN_ACC_OFF:
			LPC_CANAF->AFMR = 0x01;
			break;

		case CAN_ACC_BP:
			LPC_CANAF->AFMR = 0x02;
			break;

		case CAN_EFCAN:
			LPC_CANAF->AFMR = 0x04;
			break;
	}
}

/********************************************************************//**
 * @brief		Enable/Disable CAN Mode
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	mode: type of CAN mode that you want to enable/disable, should be:
 * 				- CAN_OPERATING_MODE: Normal Operating Mode
 * 				- CAN_RESET_MODE: Reset Mode
 * 				- CAN_LISTENONLY_MODE: Listen Only Mode
 * 				- CAN_SELFTEST_MODE: Self Test Mode
 * 				- CAN_TXPRIORITY_MODE: Transmit Priority Mode
 * 				- CAN_SLEEP_MODE: Sleep Mode
 * 				- CAN_RXPOLARITY_MODE: Receive Polarity Mode
 * 				- CAN_TEST_MODE: Test Mode
 * @param[in]	NewState: New State of this function, should be:
 * 				- ENABLE
 * 				- DISABLE
 * @return 		none
 *********************************************************************/
void CAN_ModeConfig(uint8_t canId, CAN_MODE_Type mode, FunctionalState NewState)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	switch(mode)
	{
		case CAN_OPERATING_MODE:
			pCan->MOD = 0x00;
			break;

		case CAN_RESET_MODE:
			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_RM;
			else
				pCan->MOD &= ~CAN_MOD_RM;

			break;

		case CAN_LISTENONLY_MODE:
			pCan->MOD |=CAN_MOD_RM;//Enter Reset mode

			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_LOM;
			else
				pCan->MOD &= ~ CAN_MOD_LOM;

			pCan->MOD &= ~ CAN_MOD_RM;//Release Reset mode

			break;

		case CAN_SELFTEST_MODE:
			pCan->MOD |= CAN_MOD_RM;//Enter Reset mode

			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_STM;
			else
				pCan->MOD &= ~ CAN_MOD_STM;

			pCan->MOD &= ~ CAN_MOD_RM;//Release Reset mode

			break;

		case CAN_TXPRIORITY_MODE:
			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_TPM;
			else
				pCan->MOD &= ~ CAN_MOD_TPM;

			break;

		case CAN_SLEEP_MODE:
			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_SM;
			else
				pCan->MOD &= ~ CAN_MOD_SM;

			break;

		case CAN_RXPOLARITY_MODE:
			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_RPM;
			else
				pCan->MOD &= ~ CAN_MOD_RPM;

			break;

		case CAN_TEST_MODE:
			if(NewState == ENABLE)
				pCan->MOD |= CAN_MOD_TM;
			else
				pCan->MOD &= ~ CAN_MOD_TM;

			break;
	}
}
/*********************************************************************//**
 * @brief		Set CAN command request
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @param[in]	CMRType	command request type, should be:
 * 				- CAN_CMR_TR: Transmission request
 * 				- CAN_CMR_AT: Abort Transmission request
 * 				- CAN_CMR_RRB: Release Receive Buffer request
 * 				- CAN_CMR_CDO: Clear Data Overrun request
 * 				- CAN_CMR_SRR: Self Reception request
 * 				- CAN_CMR_STB1: Select Tx Buffer 1 request
 * 				- CAN_CMR_STB2: Select Tx Buffer 2 request
 * 				- CAN_CMR_STB3: Select Tx Buffer 3 request
 * @return		CANICR (CAN interrupt and Capture register) value
 **********************************************************************/
void CAN_SetCommand(uint8_t canId, uint32_t CMRType)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	pCan->CMR |= CMRType;
}

/*********************************************************************//**
 * @brief		Get CAN interrupt status
 * @param[in]	 canId			 The Id of the expected CAN component
 *
 * @return		CANICR (CAN interrupt and Capture register) value
 **********************************************************************/
uint32_t CAN_IntGetStatus(uint8_t canId)
{
	LPC_CAN_TypeDef* pCan = CAN_GetPointer(canId);

	return pCan->ICR;
}

/*********************************************************************//**
 * @brief		Check if FullCAN interrupt enable or not
 * @param[in]	CANAFx point to LPC_CANAF_TypeDef object, should be: LPC_CANAF
 * @return		IntStatus, could be:
 * 				- SET: if FullCAN interrupt is enable
 * 				- RESET: if FullCAN interrupt is disable
 **********************************************************************/
IntStatus CAN_FullCANIntGetStatus (void)
{
	if (LPC_CANAF->FCANIE)
		return SET;

	return RESET;
}

/*********************************************************************//**
 * @brief		Get value of FullCAN interrupt and capture register
 * @param[in]	CANAFx point to LPC_CANAF_TypeDef object, should be: LPC_CANAF
 * @param[in]	type: FullCAN IC type, should be:
 * 				- FULLCAN_IC0: FullCAN Interrupt Capture 0
 * 				- FULLCAN_IC1: FullCAN Interrupt Capture 1
 * @return		FCANIC0 or FCANIC1 (FullCAN interrupt and Capture register) value
 **********************************************************************/
uint32_t CAN_FullCANPendGetStatus(FullCAN_IC_Type type)
{
	if (type == FULLCAN_IC0)
		return LPC_CANAF->FCANIC0;

	return LPC_CANAF->FCANIC1;
}
/* End of Public Variables ---------------------------------------------------------- */
/**
 * @}
 */
#endif /*_CAN*/

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
